--Заполнение таблицы с фильмами
--1
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Аватар: Путь воды',
        'После принятия образа аватара солдат Джейк Салли становится предводителем народа на''ви и берет на себя миссию по защите новых друзей от корыстных бизнесменов с Земли. Теперь ему есть за кого бороться — с Джейком его прекрасная возлюбленная Нейтири. Когда на Пандору возвращаются до зубов вооруженные земляне, Джейк готов дать им отпор.',
        2022, 6, 13, 192, 1);
--2
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Чебурашка',
        'Иногда, чтобы вернуть солнце и улыбки в мир взрослых, нужен один маленький ушастый герой. Мохнатого непоседливого зверька из далекой апельсиновой страны ждут удивительные приключения в тихом приморском городке, где ему предстоит найти себе имя, друзей и дом. Помогать — и мешать! — ему в этом будут нелюдимый старик-садовник, странная тетя-модница и ее капризная внучка, мальчик, который никак не начнет говорить, и его мама, которой приходится несладко, хотя она и варит самый вкусный на свете шоколад. И многие-многие другие, в чью жизнь вместе с ароматом апельсинов вот-вот ворвутся волшебство и приключения.',
        2022, 1, 6, 113, 2);
--3
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('О чем говорят мужчины',
        'Дело было в далеком 2019-м году… Встретившись субботним утром, чтобы выпить шампанского, друзья отправляются в новое путешествие по глубинам мужского подсознания. О чем же на этот раз говорят мужчины? Конечно, о личном. Леша пытается понять существует ли «женская дружба», Камиль рассуждает, можно ли уволить лучшего друга, ловелас Слава вспоминает первую любовь (или это была не она?), а Саша размышляет о потере отца и умению жить и радоваться каждому новому дню. А еще, прогуливаясь по центру города, друзья обсуждают, как вкрутить лампочку, чтобы она осталась довольна, о чем кричат откровенные фото в социальных сетях, и что такое чевапчичи. Они вернулись поговорить о вечном, и о личном, и о всяких пустяках… короче, обо всем.',
        2023, 1, 16, 93, 3);
--4
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Непослушная',
        'Двадцатилетняя Эля — студентка и будущий эколог. Однажды в ее университет приезжает Матвей, глава строительной компании, чтобы рассказать о плане застройки на месте старинного лесопарка. Эля не стесняясь разносит его проект в пух и прах. Матвей заинтригован самоуверенностью девушки и применяет привычные ему способы воздействия — попросту пытается её «купить». Но Эле не нужен спонсор. Тогда Матвей, удивленный ее неприступностью, предлагает Эле пари: семь романтических дней по его правилам. Если после этого девушка всё же решит уйти, он откажется от строительства небоскрёба в лесопарке. Она соглашается, когда Матвей действительно приостанавливает проектные работы. Эля видит себя кем-то вроде героини фильма «Красотка», но Матвей оказывается совсем не тем человеком, которого она себе представляла.',
        2023, 2, 18, 109, 4);
--5
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Моя пиратская свадьба',
        'Дарси и Том готовятся к роскошной свадьбе на острове. Им немного досаждают мама жениха и бывший невесты. Но вскоре пара поймёт, что это были лишь мелочи: прямо на церемонию врываются пираты и берут гостей в заложники. Дарси и Тому предстоит всех спасти.',
        2023, 4, 18, 100, 5);
--6
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Операция «Фортуна»: Искусство побеждать',
        'Элитный разведчик Орсон Форчун получил новое задание: остановить продажу и распространение смертельного оружия. Но в одиночку ему эту миссию не потянуть. Он вынужден объединиться с лучшими оперативниками мира, а также известным киноактером, который предоставит лихой группе убедительное прикрытие. На кону — судьба человечества, и в этот раз супершпионам придется играть по правилам Голливуда.',
        2023, 4, 18, 114, 6);
--7
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Снежная королева: Разморозка',
        'Озорная и смелая волшебница Айла, дочь Снежной Королевы, случайно выпускает на волю злых Ледяных Духов. Теперь, чтобы спасти все миры от вечной зимы, Айла должна отправиться на поиски Кая и Герды, собрать команду верных друзей и научиться владеть своей магией. Вместе им предстоит захватывающее приключение, ведь настоящая дружба способна растопить любой лёд.',
        2022, 3, 6, 75, 7);
--8
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Метки тьмы',
        'Семья переезжает в Новый Орлеан в надежде начать жизнь с чистого листа. Однако вскоре в новом доме начинают происходить жуткие вещи — дети видят странные метки, мать семейства Рэйчел преследует кукла, напоминающая погибшую дочь, а в подвале образуются трещины. Чтобы спасти семью, Рэйчел должна разгадать страшную тайну места, в котором был построен дом.',
        2021, 5, 18, 105, 8);
