--Заполнение таблицы с фильмами
--1
INSERT INTO films(name, description, year, genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Аватар: Путь воды',
        'После принятия образа аватара солдат Джейк Салли становится предводителем народа на''ви и берет на себя миссию по защите новых друзей от корыстных бизнесменов с Земли. Теперь ему есть за кого бороться — с Джейком его прекрасная возлюбленная Нейтири. Когда на Пандору возвращаются до зубов вооруженные земляне, Джейк готов дать им отпор.',
        2022, 7, 13, 192, 1);
--2
INSERT INTO films(name, description, year, genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Чебурашка',
        'Иногда, чтобы вернуть солнце и улыбки в мир взрослых, нужен один маленький ушастый герой. Мохнатого непоседливого зверька из далекой апельсиновой страны ждут удивительные приключения в тихом приморском городке, где ему предстоит найти себе имя, друзей и дом. Помогать — и мешать! — ему в этом будут нелюдимый старик-садовник, странная тетя-модница и ее капризная внучка, мальчик, который никак не начнет говорить, и его мама, которой приходится несладко, хотя она и варит самый вкусный на свете шоколад. И многие-многие другие, в чью жизнь вместе с ароматом апельсинов вот-вот ворвутся волшебство и приключения.',
        2022, 1, 6, 113, 2);